//************************************************************************************************
&НаКлиенте
Процедура ПослеВводаСтроки(Результат, Параметры) Экспорт
КонецПроцедуры
//************************************************************************************************
&НаКлиенте
Процедура Exchange_ПолучитьСсылкуПосле(Команда)
	
	Ссылка = Exchange_УдаленнаяБаза.ПолучитьСсылку(Объект.Ссылка, Новый Структура("СписаниеТоваров"));
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект), Ссылка, "Ссылка", 0, Истина);
		
	КонецЕсли;
	
КонецПроцедуры
//************************************************************************************************
