//************************************************************************************************
&НаСервереБезКонтекста
Процедура Exchange_СписокПриПолученииДанныхНаСервереВместо(ИмяЭлемента, Настройки, Строки)

	Exchange_УдаленнаяБаза.ПроверитьДокументы(Строки, Новый Структура("СводныйВозврат, ВозвратТоваровОтПокупателя"));
	
КонецПроцедуры
//************************************************************************************************
&НаКлиенте
Процедура Exchange_ПроверкаПосле(Команда)
	
	Если Элементы.Список.ТекущиеДанные.ДатаОформлениеЯчейки.ЦветФона <> WebЦвета.Белый Тогда
		
		Данные = Exchange_УдаленнаяБаза.ПроверкаДокумента(Элементы.Список.ТекущаяСтрока, Новый Структура("СводныйВозврат, ВозвратТоваровОтПокупателя"));	

		Если Данные <> Неопределено Тогда

			ОткрытьФорму("Отчет.Exchange_Проверка.ФормаОбъекта", Новый Структура("Ссылка, Данные", Элементы.Список.ТекущаяСтрока, Данные));
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
//************************************************************************************************