//*******************************************************************************
&НаКлиенте
Функция ПроверкаПравил(Вид)
	
	Результат = Неопределено;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		
		ЧтениеJSON.УстановитьСтроку(Запись["Правила" + Вид]);
		
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		ЧтениеJSON.Закрыть();

	Исключение
		
		ВызватьИсключение "Правила " + НРег(Вид) + ", не соответстуют правилам json";
		
	КонецПопытки;
	
	Возврат НЕ (Результат <> Неопределено);

КонецФункции
//*******************************************************************************
&НаКлиенте
Процедура ПравилаВыгрузкиПриИзменении(Элемент)
	
	ПроверкаПравил("Выгрузки");

КонецПроцедуры
//*******************************************************************************
&НаКлиенте
Процедура ПравилаЗагрузкиПриИзменении(Элемент)
	
	ПроверкаПравил("Загрузки");

КонецПроцедуры
//*******************************************************************************
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ПроверкаПравил("Выгрузки");
	Отказ = ПроверкаПравил("Загрузки");
	
КонецПроцедуры
//*******************************************************************************
