//***********************************************************************************************************
Функция ВBase64(Строка) Экспорт
	
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Строка, "UTF-8"));	
	
КонецФункции
//***********************************************************************************************************
Функция ИзBase64(Строка) Экспорт
	
	Возврат ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Строка), "UTF-8");
	
КонецФункции
//***********************************************************************************************************
 