//************************************************************************************************
Функция ЕстьЭСФ(Ссылка) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СФ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|	И СчетФактураВыданный.ДокументОснование = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭСФ.Ссылка КАК Ссылка,
	|	ЭСФ.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ЭСФ
	|ИЗ
	|	Документ.ЭСФ КАК ЭСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭСФ.Ссылка КАК Ссылка,
	|	ЭСФ.СчетФактура КАК СчетФактура
	|ИЗ
	|	СФ КАК СФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭСФ КАК ЭСФ
	|		ПО (ЭСФ.СчетФактура = СФ.Ссылка)");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			Возврат Истина;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
//************************************************************************************************
Функция ПолучитьСчетФактуру(ДокументОснование) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|	И СчетФактураВыданный.ДокументОснование = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

		Возврат Выборка.Ссылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	Возврат Документы.СчетФактураВыданный.СоздатьДокумент();
	
КонецФункции
//************************************************************************************************
Функция ПропускатьЗагруженныеДокументы(ТекущийОбъект, Пропуск) Экспорт
	
	Если Пропуск Тогда
		
		Возврат ЗначениеЗаполнено(ТекущийОбъект.Ссылка); 
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//************************************************************************************************ 
Процедура УстановитьНовыйНомер(Документ, Тип) Экспорт
	
	Если Документ.Ссылка = Документы[Тип].ПустаяСсылка() Тогда	
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ." + Тип + " КАК Документ
		|ГДЕ
		|	Документ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ГОД)
		|	И Документ.Номер = &Номер");
		
		Запрос.УстановитьПараметр("Дата",	 Документ.Дата);
		Запрос.УстановитьПараметр("Номер",	 Документ.Номер);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			Документ.УстановитьНовыйНомер("0");
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры
//************************************************************************************************